Revit 2027 API
ParameterTypeId.SurfacePerimeter Property
 "Perimeter"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SurfacePerimeter { get; }
Public Shared ReadOnly Property SurfacePerimeter As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SurfacePerimeter {
	ForgeTypeId^ get ();
}
static member SurfacePerimeter : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace